controllers/PaymentsController.php

public function actionValidation()
{
$model= new Payments();
//http://dev.secudesk.co.ke/lotto/api/services/inbox
 //\Yii::$app->response->format = \yii\web\Response:: FORMAT_JSON;

$post =Yii::$app->request->getRawBody();
Yii::warning('SMS REQUEST '.$post, __METHOD__);
 $data =json_decode($post,true);
// $postData =  file_get_contents('php://input');

if(!is_array($data))

{
          throw new HttpException(500,"Invalid Request");
}
         else{
          $content = Orders::find()
        ->where(['name' =>$data['BillRefNumber']])
        ->one();
---
SELECT * FROM `orders` WHERE `name`='Brand'


{

$content = Content::find()
        ->where(['keyword' =>$model->contentName])
        ->one();
---
SELECT * FROM `content` WHERE `keyword`='Brand'




      if($downloads->validate() && $downloads->save())
---
INSERT INTO `downloads` (`orderID`, `clientID`, `contentName`, `MSISDN`, `uuid`, `dateCreated`, `active`, `downloads`, `updatedBy`, `insertedBy`) VALUES (1, 14, 'Brand', '254726742902', '0076aa37ef269', NOW(), 1, 'http://localhost/d/0076aa37ef269', 254726742902, 254726742902)

     $outmessages->updatedBy =  $downloads->updatedBy;
     $outmessages->createdBy =  $content->clientID;

       if  ($outmessages->validate() && $outmessages->save())
---
INSERT INTO `outMessages` (`ordersID`, `clientID`, `paymentID`, `downloadID`, `contentName`, `messageContent`, `MSISDN`, `dateCreated`, `active`, `updatedBy`, `createdBy`) VALUES (1, 14, 66, 27, 'Brand', 'Dear Customer, to download :Brand Content,click on this link here: http://localhost/d/0076aa37ef269.Thank You.', '254726742902', NOW(), 1, 254726742902, 14)