controllers/ServicesController.php

    public function actionInbox()
    {
	$model = new InMessages();

$post =Yii::$app->request->getRawBody();
Yii::warning('SMS REQUEST '.$post, __METHOD__);

$data =json_decode($post,true);


$identify_client =  Content::find()
        ->where(['keyword' => $data['MESSAGE']])
        ->one();

if(!is_array($data))
          throw new HttpException(500,"Invalid Request");
  $this->paybill= @$data['MESSAGE'] ;
		$this->account_num= @$data['MSISDN'] ;


 $model->MSISDN = @$data['MSISDN'] + 0;
$model->clientID = $identify_client->clientID;
$model->messageContent = @$data['MESSAGE'] ;
$model->shortCode = @$data['SHORTCODE'] ;
//$model->active = @$data['STATUS'] ;
//$inboxRoute-> = str_replace("soma","",$inboxRoute->);
//$model->linkID  = @$data['link_id'] ;


$model->updatedBy =  @$data['MSISDN'];
$model->createdBy =  @$data['MSISDN'];
---
SELECT * FROM `content` WHERE `keyword`='Brand'
INSERT INTO `inMessages` (`MSISDN`, `clientID`, `messageContent`, `shortCode`, `updatedBy`, `createdBy`, `dateCreated`) VALUES ('254704716989', 14, 'Brand', 3040, 254704716989, 254704716989, NOW())

if($model->validate() && $model->save())
{

$content = Content::find()
        ->where(['keyword' => $model->messageContent])
        ->one();
---
SELECT * FROM `content` WHERE `keyword`='Brand'


     $orders->insertedBy = $model->createdBy;
    $orders->dateCreated = new Expression('NOW()');
   if ( $orders->save())
---
INSERT INTO `orders` (`clientID`, `contentID`, `messageID`, `MSISDN`, `name`, `active`, `insertedBy`, `dateCreated`) VALUES (14, 5, 14, 254704716989, 'Brand', 1, 254704716989, NOW())